In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series(['one', 'two', np.nan, 'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
# find null value
data.isnull()
# data.notnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()
# drop null value

0     one
1     two
3    four
dtype: object

In [5]:
dframe = pd.DataFrame([[1,2,3],[np.nan, '5', '6'], [7, np.nan, 9], [np.nan, np.nan, np.nan]])
dframe

     0    1    2
0  1.0    2    3
1  NaN    5    6
2  7.0  NaN    9
3  NaN  NaN  NaN

In [8]:
clean_dframe = dframe.dropna()
clean_dframe
# drop every row and col that includes null

     0  1  2
0  1.0  2  3

In [9]:
dframe.dropna(how = 'all')
# df.dropna(): https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

     0    1  2
0  1.0    2  3
1  NaN    5  6
2  7.0  NaN  9

In [10]:
dframe.dropna(axis = 1)
# every single row includes nan. So, everythin was dropped

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
npn = np.nan
dframe2 = pd.DataFrame([[1,2,3,npn], [2,npn, 5,6], [npn,7,npn,9], [1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [13]:
dframe2.dropna(thresh=2)
# if index includes more than two null, then drop

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [14]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [15]:
dframe.fillna(1)
# fill with all null value with 1

     0  1  2
0  1.0  2  3
1  1.0  5  6
2  7.0  1  9
3  1.0  1  1

In [16]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [17]:
dframe2.fillna({0:0, 1:1, 2:2, 3:3})
# index 0 = 0, index 1 = 1 .......

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [18]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [20]:
dframe2.fillna(0, inplace=True)
# permanetly change dframe2

In [21]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0